       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. Thomas VELU.

       PROCEDURE DIVISION.
           
           DISPLAY "Hello world !".
           
           STOP RUN.
      